# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
list1_sum = sum([x for i, x in enumerate(list1) if i % 2 == 1])

print(list1_sum)
