# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной
# последовательности.

list1 = [2, 3, 4, 2, 5, 5, 6]
result = set(list1)

print(result)
