# 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.


n = int(input("Введите число: "))
a = []

for i in range(1, n+1):
    b = 1
    for j in range(1, i+1):
        b *= j
    a.append(b)

print(a)

