# 1.Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день
# выходным.


day_week = 0
while day_week < 1 or day_week > 7:
    day_week = int(input('Введите цифру, обозначающую день недели: '))
    if day_week == 6 or day_week == 7:
        print('Сегодня выходной день')
    elif 0 < day_week < 6:
        print('Сегодня не выходной день')
    else:
        print('Вы ввели неверную цифру, попробуйте ещё раз: ')
