# 3.Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти
# плоскости, в которой находится эта точка (или на какой оси она находится).


x = 0
y = 0
while x == 0 and y == 0:
    x = int(input('Введите координату точки Х: '))
    y = int(input('Введите координату точки Y: '))
    if x > 0 and y > 0:
        print('Первая четверть')
    elif x < 0 and y > 0:
        print('Вторая четверть')
    elif x < 0 and y < 0:
        print('Третья четверть')
    elif x > 0 and y < 0:
        print('Четвёртая четверть')
    else:
        print('Введите координаты отличные от 0: ')
