# 5.Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# AB = √(xb - xa)2 + (yb - ya)2

xa = float(input('Введите координату хa: '))
xb = float(input('Введите координату хb: '))
ya = float(input('Введите координату ya: '))
yb = float(input('Введите координату yb: '))
distance = (((xb - xa) ** 2) + ((yb - ya) ** 2)) ** 0.5
print(round(distance))


